"""
Задача №1
Умова задачі: Знайти кількість відрізків b, розміщених навідрізку a,
і довжину незайнятої частини на відрізку a.
Користувачем вводиться довжина відрізка a,
а потім довжина відрізка b на окремих рядках.
Відповідь виводиться в одному рядку: кількість відрізків b
і довжина незайнятої частини відрізка a.

Автор: Мотовилець Марія Тарасівна
"""
a = int(input("Введіть довжину відрвзка а: "))
b = int(input("Введіть довжину відрвзка b: "))

print(f"Кількість відрізків b розміщених на відрізку а: {a//b}, довжина незайнятої частини а: {a%b} ")
